[
	{
		"Code": "COM101",
		"Level": "Undergraduate",
		"Name": "Effective Reading and Comprehension Skills",
		"Credits": 3,
		"isBiSem": false,
		"Faculties": [
			"Chirag Trivedi",
			"Gatha Joshipura",
			"Preeti Maneck",
			"Sakshi Soni"
		],
		"Prerequisite": "COM 100 Elements of Academic Reading and Writing,[ COM100 or should have performed well in the English Competency Test ]",
		"Description": "COM101 is the intermediate level of the university's communication courses designed to promote linguistic and academic development. This is a reading and comprehension course to train students to develop general competence and advanced analytical strategies in reading. This course prepares students to communicate in English at the level required for success in their core courses and beyond graduation.",
		"Sections": {
			"1": {
				"Mon": [
					["08:00", "09:30"], // first element is always time
					["09-01-2023", "23-04-2023"] // second is always date
				],
				"Wed": [
					["08:00", "09:30"],
					["09-01-2023", "23-04-2023"]
				]
			},
			"2": {
				"Tue": [
					["08:00", "09:30"],
					["09-01-2023", "23-04-2023"]
				],
				"Thu": [
					["08:00", "09:30"],
					["09-01-2023", "23-04-2023"]
				]
			}
		}
	},
	{
		"Code": "MGT136",
		"Level": "Undergraduate",
		"Name": "Indian Legal System",
		"isBiSem": false,
		"Credits": 1.5,
		"Faculties": ["Krishna Mehta"],
		"Prerequisite": null,
		"Description": "Day-to-day living and Business operations have to be carried out within the legal framework of a country. This premise requires a student to attain working knowledge about the legal systems and some laws which impact the everyday life. The course aims at meeting this requirement. The course begins with introduction to the Indian Legal System, proceeds to discuss the important Rights of every Indian and finally explains selected commercial laws. The topics discussed throughout the course aim to ensure personal and professional well being of the students from the legal context. Students should expect to deal with quite a few court cases over the semester and in some cases present them in writing. ",
		"Sections": {
			"1": {
				"Mon": [
					["11:00 ", "12:30"],
					["09-01-2023", "23-04-2023"]
				],
				"Wed": [
					["08:00", "09:30"],
					["09-01-2023", "23-04-2023"]
				]
			},
			"2": {
				"Tue": [
					["08:00", "09:30"],
					["09-01-2023", "23-04-2023"]
				],
				"Thu": [
					["08:00", "09:30"],
					["09-01-2023", "23-04-2023"]
				]
			}
		}
	}
]
